/**
 * Все используемые данные в javascript имеют определенный тип. В JavaScript имеется восемь типов данных:
 * String: представляет строку
 * Number: представляет числовое значение
 * BigInt: предназначен для представления очень больших целых чисел
 * Boolean: представляет логическое значение true или false
 * Undefined: представляет одно специальное значение - undefined и указывает, что значение не установлено
 * Null: представляет одно специальное значение - null и указывает на отсутствие значения
 * Symbol: представляет уникальное значение, которое часто применяется для обращения к свойствам сложных объектов
 * Object: представляет комплексный объект
 */